ОсновныеОбъектыЗанятие6Финиш/src/DataProcessors/ЗаполнениеКурсаВалюты/ЗаполнениеКурсаВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеКурсаВалюты</name>
</mdclass:DataProcessor>

ОсновныеОбъектыЗанятие6Финиш/src/InformationRegisters/ОтносительныеКурсыВалют/ОтносительныеКурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтносительныеКурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОсновныеОбъектыЗанятие6Финиш/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <comment>Валюты</comment>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6Финиш/src/DataProcessors/ЗаполнениеКурсаВалюты/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьСервер();
	
	Сообщить("Курс валюты " + БуквенныйКод + " установлен");

КонецПроцедуры

&НаСервере
Процедура УстановитьСервер()
		
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.ОтносительныеКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		ЗаписьРегистраСведений.КурсЧислитель = КурсЧислитель;
		ЗаписьРегистраСведений.КурсЗнаменатель = ?(КурсЗнаменатель = 0, 1, КурсЗнаменатель);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(ФИООтветственного, Ложь);

		Попытка
			ЗаписьРегистраСведений.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Если СсылкаНаВалюту.ДатаКурса > Дата Тогда
			Возврат; //ДЗ
		КонецЕсли;


		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		СпрВалютыОбъект.КурсЧислитель = КурсЧислитель;
		СпрВалютыОбъект.КурсЗнаменатель = КурсЗнаменатель;
		СпрВалютыОбъект.ДатаКурса = Дата;

		Попытка
			СпрВалютыОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		БуквенныйКод =  СсылкаНаВалюту.БуквенныйКод;

	КонецЕсли;
	
	
КонецПроцедуры
